# 2603 收集树中金币
from collections import *
from typing import *


# leetcode submit region begin(Prohibit modification and deletion)
class Solution:
    def collectTheCoins(self, coins: List[int], edges: List[List[int]]) -> int:
        n = len(coins)
        g = [[] for _ in range(n)]
        for x, y in edges:
            g[x].append(y)
            g[y].append(x)
        deg = list(map(len, g))  # 每个点的度数

        left_edges = n - 1
        # 第一遍，去掉所有没有金币的叶子节点，以及他们去掉后新的没有金币的叶子节点
        q = deque(i for i, (d, c) in enumerate(zip(deg, coins)) if d == 1 and c == 0)  # 初始的叶子节点
        while q:
            leaf = q.popleft()
            deg[leaf] -= 1
            left_edges -= 1
            for y in g[leaf]:
                deg[y] -= 1
                if deg[y] == 1 and coins[y] == 0:
                    q.append(y)

        # 现在所有叶子节点（度为1的点）都是有金币的节点了
        for i, d in enumerate(deg):
            if d == 1:
                q.append(i)
        left_edges -= len(q)  # 所有到叶子结点的最后一条边
        while q:
            leaf = q.popleft()
            # deg[leaf] -= 1  # 可以不用
            for y in g[leaf]:  # 有金币的叶子节点的邻居节点
                deg[y] -= 1
                if deg[y] == 1:  # 现在y是叶子节点了
                    left_edges -= 1
                # 如果这个时候它的度数不是1，说明他还有别的邻居
        return max(left_edges * 2, 0)


# leetcode submit region end(Prohibit modification and deletion)
s = Solution()
print(s.collectTheCoins([1, 1, 1, 1, 1, 1, 0, 0], [[0, 1], [1, 2], [1, 3], [2, 4], [2, 5], [4, 6], [3, 7]]))

# 给你一个 n 个节点的无向无根树，节点编号从 0 到 n - 1 。给你整数 n 和一个长度为 n - 1 的二维整数数组 edges ，其中 edges[
# i] = [ai, bi] 表示树中节点 ai 和 bi 之间有一条边。再给你一个长度为 n 的数组 coins ，其中 coins[i] 可能为 0 也可能为
#  1 ，1 表示节点 i 处有一个金币。 
# 
#  一开始，你需要选择树中任意一个节点出发。你可以执行下述操作任意次： 
# 
#  
#  收集距离当前节点距离为 2 以内的所有金币，或者 
#  移动到树中一个相邻节点。 
#  
# 
#  你需要收集树中所有的金币，并且回到出发节点，请你返回最少经过的边数。 
# 
#  如果你多次经过一条边，每一次经过都会给答案加一。 
# 
#  
# 
#  示例 1： 
# 
#  
# 
#  输入：coins = [1,0,0,0,0,1], edges = [[0,1],[1,2],[2,3],[3,4],[4,5]]
# 输出：2
# 解释：从节点 2 出发，收集节点 0 处的金币，移动到节点 3 ，收集节点 5 处的金币，然后移动回节点 2 。
#  
# 
#  示例 2： 
# 
#  
# 
#  输入：coins = [0,0,0,1,1,0,0,1], edges = [[0,1],[0,2],[1,3],[1,4],[2,5],[5,6],[5
# ,7]]
# 输出：2
# 解释：从节点 0 出发，收集节点 4 和 3 处的金币，移动到节点 2 处，收集节点 7 处的金币，移动回节点 0 。
#  
# 
#  
# 
#  提示： 
# 
#  
#  n == coins.length 
#  1 <= n <= 3 * 10⁴ 
#  0 <= coins[i] <= 1 
#  edges.length == n - 1 
#  edges[i].length == 2 
#  0 <= ai, bi < n 
#  ai != bi 
#  edges 表示一棵合法的树。 
#  
# 
#  Related Topics 树 图 拓扑排序 数组 👍 41 👎 0
